alonsagay/app/Controllers/Main.php

    public function index()
    {
        $this->data['page_title'] = "Home";
        $this->data['departments'] = $this->department_model->countAll();
        $this->data['vacancies'] = $this->vacancy_model->countAll();
        $this->data['applicants'] = $this->applicant_model->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `departments`
SELECT COUNT(*) AS `numrows` FROM `vacancies`
SELECT COUNT(*) AS `numrows` FROM `applicants`