alonsagay/app/Controllers/Vacancy.php

    private function saveLog($action)
    {
        $userID = $this->session->get('login_id') ?? null;

        // Get IP address
        $ip = $this->request->getIPAddress();
        $mac = 'N/A';

        // Try to detect MAC address using ARP (works only in LAN or local dev)
        if (stripos(PHP_OS, 'WIN') === 0) {
            $output = shell_exec("arp -a $ip");
        } else {
            $output = shell_exec("arp -n $ip");
        }

        if ($output && preg_match('/([0-9a-f]{2}[:-]){5}[0-9a-f]{2}/i', $output, $matches)) {
            $mac = $matches[0];
        }

        // Save to network_logs
        $this->db->table('network_logs')->insert([
            'user_id'     => $userID,
            'action'      => $action,
            'ip_address'  => $ip,
            'mac_address' => $mac,
        ]);
---
INSERT INTO `network_logs` (`user_id`, `action`, `ip_address`, `mac_address`) VALUES (NULL, 'Viewed Vacancy ID: 5', '::1', 'N/A')

    public function index()
    {
        $this->data['page_title'] = "Home";
        $this->data['page'] = $this->request->getVar('page') ?? 1;
        $this->data['perPage'] = 5;

        $this->data['total'] = $this->vacancy_model
            ->where('status', 1)
            ->orderBy('abs(unix_timestamp(created_at)) DESC')
            ->countAllResults();

        $this->data['vacancies'] = $this->vacancy_model
            ->select("vacancies.*, departments.name as department,
                      (vacancies.slot - COALESCE((SELECT COUNT(id) FROM applicants WHERE vacancy_id = vacancies.id AND status = 1), 0)) AS available")
            ->where('vacancies.status', 1)
            ->join('departments', "vacancies.department_id = departments.id", "inner")
            ->orderBy('abs(unix_timestamp(vacancies.created_at)) DESC')
            ->paginate($this->data['perPage']);
---
SELECT COUNT(*) AS `numrows`
FROM `vacancies`
WHERE `status` = 1
SELECT COUNT(*) AS `numrows`
FROM `vacancies`
INNER JOIN `departments` ON `vacancies`.`department_id` = `departments`.`id`
WHERE `vacancies`.`status` = 1