alonsagay/app/Filters/MaintenanceFilter.php

    public function before(RequestInterface $request, $arguments = null)
    {
        $uri = service('uri');
        $path = strtolower(trim($uri->getPath(), '/'));

        // Allow these routes even during maintenance
        $allowed = [
            'maintenance',                        // maintenance page itself
            'main/login',                         // admin login
            'auth/login',                         // in case using different route
            'systemsetting/togglemaintenance',    // allow admin toggle only
        ];

        // Allow admin pages also (Main/*)
        if (strpos($path, 'main') === 0) {
            return; // Admin panel always accessible
        }

        // Check maintenance mode
        $model = new SystemSettingModel();
        $setting = $model->first();
---
SELECT *
FROM `system_settings`
 LIMIT 1