alonsagay/app/Views/layouts/main.php

use App\Models\SystemSettingModel;
$session = session();
$sysModel = new SystemSettingModel();
$system = $sysModel->first();
---
SELECT *
FROM `system_settings`
 LIMIT 1